---
title: ConduitSizes
classe: Autodesk.Revit.DB.Electrical.ConduitSizes
namespace: Autodesk.Revit.DB.Electrical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# ConduitSizes

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Count { get; }` | `conduitSizes.Count` | Int32 |
| `Boolean IsValidObject { get; }` | `conduitSizes.IsValidObject` | Boolean |
| `Boolean Contains(Double)` | `conduitSizes.Contains(nominalDiameter)` | Boolean |
| `Void Dispose()` | `conduitSizes.Dispose()` | Void |
| `ConduitSizeIterator GetConduitSizesIterator()` | `conduitSizes.GetConduitSizesIterator()` | ConduitSizeIterator |
| `IEnumerator<ConduitSize> GetEnumerator()` | `conduitSizes.GetEnumerator()` | IEnumerator<ConduitSize> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```